START_MESSAGE = 'Ты попал в бота <b>A4 VIP локер</b>! ' \
                '\n 🟡 Если у тебя есть секретный код, то нажимай первую кнопку! ' \
                '\n ⚫️ Если у тебя есть вопросы по получению локеров - нажимай вторую кнопку!'

START_MESSAGE_FOR_USERS_IN_BASE = 'Ты попал в бота <b>A4 VIP локер</b>!\n\n' \
                                  'Ты уже активировал свой код, осталось дождаться получения твоего золоченого локера\n\n' \
                                  'Если у тебя есть вопросы по получению локеров - нажимай кнопку!'

FIRST_BUTTON_TEXT = ' 💎 Ввести секретный код'
SECOND_BUTTON_TEXT = ' 📝 Написать нам'
NO_CHANGES_TEXT = 'Всё верно!'
CHANGE_NAME_TEXT = 'Изменить ФИО'
CHANGE_PHONE_TEXT = 'Изменить номер телефона'
CHANGE_ADDRESS_TEXT = 'Изменить адрес'

SUPPORT_MSG = 'Если у тебя есть вопросы по получению локеров,' \
              '\nто пиши нам на почту 📧 a4viploker@topson.ru'
ENTER_CODE_MSG = 'Напиши секретный код, который ты нашел в локере:'
ENTER_CODE_ERROR_MSG = 'Упс, такого кода нет в системе. Попробуй еще раз!'
ENTER_CODE_SUCCESS = '🎊🥳<b>Это правильный код!</b>🥳🎊\n'
ENTER_NAME_MSG = 'Чтобы получить локер, напиши свое имя и фамилию'
ENTER_NAME_ERROR_MSG = 'Упс, не получилось. Попробуй еще раз!' \
                       '\nИмя и фамилия состоит минимум из двух слов'
ENTER_PHONE_MSG = 'Отлично, '
ENTER_PHONE_MSG_OST = 'теперь напиши свой номер телефона в таком формате: <b>89997776666</b>'
ENTER_PHONE_ERROR = 'Упс, не получилось. Попробуй еще раз!' \
                    '\n*Должно быть ровно 11 цифр'
ENTER_ADDRESS_MSG = 'Отлично, теперь последнее:\n'
ENTER_ADDRESS_MSG_OST = 'Напиши свой точный адрес. Обязательно укажи название города,' \
                        ' улицы и квартиры, а также свой индекс. Проверь данные перед тем, как направить их нам, ' \
                        'чтобы твой локер точно смог тебя найти!'
ENTER_ADDRESS_ERROR_MSG = 'Упс, не получилось, адрес не может быть пустым. Попробуй еще раз!'
FINAL_SUCCESS = 'Супер! Мы получили все данные. ' \
                'Сейчас мы их обработаем и в течение трех дней направим тебе Золоченый VIP локер!'

ALREADY_CLAIMED = 'Твой локер уже едет к тебе! Один локер в одни руки'

BANNED_USER_MSG = 'Превышен возможный лимит обращений к боту, к сожалению Вы не сможете им пользоваться!'
BANNED_MSG = 'Вам запрещен доступ к боту!\nУ тебя было 5 попыток ввода.\n' \
             'Если считаешь что твой код был верным напиши нам на почту 📧 a4viploker@topson.ru'

CONGRATS_PHOTO_ID = 'AgACAgIAAxkBAAIGj2OpyTJ3ruCr0kfIEz8wKF07BaLdAAKxyTEbyuNQSZEoGBX2_vd0AQADAgADeQADLAQ'
WHERE_CODE_PHOTO_ID = 'AgACAgIAAxkBAAIEpWOoJsMbUQGLxBMZ-70bfO8n2mzDAAJFxzEbmt9ISUHHJJu5un7WAQADAgADeQADLAQ'

record_dict = {
    "key": "код",
    "address": "адрес",
    "code_number": '№ кода по списку',
    "date_of_receiving": 'дата получения',
    "date_of_shipping": 'дата отправки',
    "is_activated": 'активирован',
    "name": 'фио',
    "phone": 'телефон',
    "telegram_id": 'telegram id',
    "track_number": 'трек-номер',
    "username": 'имя пользователя telegram',
    "activation_date": 'дата активации',
}
